Revit 2026 API
AreaReinforcement.Create Method
Overload List
Name | Description
Create(Document, Element, XYZ, ElementId, ElementId, ElementId) |  Creates a new AreaReinforcement object based on a host boundary.
Create(Document, Element, IList<Curve>, XYZ, ElementId, ElementId, ElementId)
Top
See Also
Reference
AreaReinforcement Class
Autodesk.Revit.DB.Structure Namespace